<template>
  <yi-model-wechat
    :brand-filter="brandFilter"
    :firms-filter="firmsFilter"
    :series-filter="seriesFilter"
    :model-filter="modelFilter"
    @on-select-success="onModelSelect"
  />
</template>

<script>
export default {
  name: 'ModelLibWechatDemo',
  data() {
    return {
      modelFilter: ["Jeep 自由侠 2018款 1.4T 双离合 180T高能版","Jeep 自由光 2019款 2.0L 自动 两驱典尚版 国VI","奥迪Q2L 2018款 1.4T 双离合 35TFSI 上市专享版","奥迪 Q2L 2018款 1.4T 双离合 35TFSI 上市专享版","宝马 1系 2019款 1.5T 自动 118i 时尚型","宝马2系旅行车 2018款 1.5T 自动218i时尚版","北京 BJ20 2018款 1.5T CVT 豪华版","北京汽车 D70 2018款 1.8T 自动 性能版 舒适版","北京汽车 D70 2018款 1.8T 自动 性能版 舒适版","本田 CR-V 2020款 1.5T CVT 耀目版 240TURBO 两驱 舒适版","本田 缤智 2019款 1.5L CVT 先锋版 国V","本田 凌派 2019款 1.0T CVT 180Turbo 舒适版","本田 思域 2019款 1.5T CVT 220TURBOCVT 燃动版 国VI","本田 思域 2019款 1.5T CVT 220TURBOCVT 劲动版 国VI","本田 雅阁 2018款 1.5T CVT 260TURBO精英版 国VI","标致 2008 2018款 1.6L 自动 潮流版","别克 昂科威 2019款 1.5T 双离合 20T 两驱领先版 国VI","别克 凯越 2019款 1.3L CVT 15N精英版","别克 威朗 2019款 1.5L 自动 三厢 15S领先版","别克 英朗 2019款 1.3T 自动 18T 互联精英版 国V","别克 英朗 2019款 1.0T 双离合 15T 互联精英版 国V","别克 英朗 2019款 1.0T自动 15T 双离合进取 国V","别克 英朗 2019款 1.0T 双离合 15T 互联精英版 国VI","大众 宝来 2020款 1.5L 自动 时尚型","大众 宝来 2019款 1.5L 自动 宝来·传奇 时尚版","大众 朗逸 2019款 1.5L 自动 舒适版 国V","大众 朗逸 2019款 1.4T 舒适版 国V","大众 朗逸 2019款 1.5L 自动 风尚版 国V","大众 迈腾 2019款 1.4T 双离合 280TSI 舒适版 国V","大众 帕萨特 2017款 1.8T 双离合 330TSI 尊荣版","大众 帕萨特 2019款 1.4T 双离合280TSI 商务版国VI","大众 桑塔纳 2019款 1.5L 自动 风尚版 国V","大众 速腾 2018款 1.6L 自动 舒适版","大众 速腾 2019款 1.2T 双离合 200TSI 舒适版","东风风神 AX5 2017款 1.4T 双离合 趣悦型","东风风行 景逸X5 2018款 1.6L CVT 乐享系列 网联版 7座","东风风行 景逸X5 2017款 1.6L CVT 乐享系列豪华型","丰田 卡罗拉 2019款 1.2T CVT 先锋版","丰田 凯美瑞 2019款 2.0L CVT G豪华版 国V","丰田 雷凌 2019款 1.2T CVT 185T 豪华版 国V","福特 福克斯两厢 2018款 1.6L 双离合 两厢风尚版","观致5 2018款 1.6T 双离合 改款 尊贵版","哈弗 H6 2020款 1.5T 双离合 铂金豪华版","哈弗 H6 2019款 1.5T 自动 运动版 两驱精英型 国VI","哈弗 M6 2019款 1.5T 双离合 精英型 国VI","汉腾X7 2018款 1.5T 自动 X7S 豪华版 国V","吉利 帝豪 2019款 1.5L CVT 领军版 豪华型 国VI","吉利 博越 2020款 1.8T 双离合 两驱 智联型4G互联版","君马MEET 3 2018款 1.5T 手动 舒适版","君马MEET 3 2018款 1.5T CVT 舒适版","君马 SEEK 5 2018款 1.5T 自动 领智版","猎豹 CS9 2018款 1.5T CVT 劲悦版","陆风 逍遥 2018款 1.5T CVT GTDI 白银版","马自达3 昂克赛拉 2019款 1.5L 自动 云控版 三厢 舒适型 国V","马自达3 昂克赛拉 2019款 1.5L 自动 云控版 三厢 豪华型 国V","名爵ZS 2018款 1.5L 自动 精英版 国V","名爵ZS 2019款 1.5L 手动 65寸巨幕天窗全球版 国VI","名爵 锐腾 2019款 2.0T 双离合 30T 两驱 尊享互联网氙灯版","纳智捷 优6 SUV 2019款 1.8T 自动 经典舒适版","奇瑞 瑞虎7i 2019款 1.5TCI 双离合 基本版","起亚 福瑞迪 2019款 1.6L 自动 风尚版","起亚K5 2016款 2.0L 自动GLS","起亚 奕跑 2019款 1.4L 自动 趣享版 国VI","日产 蓝鸟 2019款 1.6L CVT 智联智酷版","日产 奇骏 2020款 2.0L CVT 两驱 智联舒适版 5座","日产 逍客 2019款 2.0L CVT 智享版","日产 轩逸 2019款 1.6L CVT XV 智联尊享版 国VI","日产 轩逸 2019款 1.6L CVT 经典 XE 舒适版","荣威i5 2019款 1.5L CVT 4G互联领豪版","荣威i5 2019款 1.5L CVT 4G互联领豪旗舰版","荣威RX3 2020款 1.6L CVT 4G互联超爽旗舰","荣威RX5 2019款 1.5T 手动 20T 4G互联铂金版","荣威 RX5 2019款 1.5T 手动 20T Ali智联网铂金版","荣威RX5 2019款 1.5T 双离合 20T 4G互联铂金版","荣威RX5 2019款 1.5T 双离合 20T 两驱 Ali 智联网铂金版","大众 朗逸 2019款 1.5L 自动 风尚版 国VI","斯柯达 明锐 2018款 1.6L 自动 舒适版","斯柯达 速派 2018款 1.4T 双离合 280TSI 标准版 国V","宝骏510 2019款 1.5L CVT 乐享型 国VI","现代 ENCINO 2018款 1.6T 双离合 致联版","现代 名图 2017款 1.8L 自动 智能版 国VI","现代 ix25 2017款 1.6L 自动 智能版 国VI","雪佛兰 创酷 2019款 1.0T 自动 325T 劲","雪佛兰 科鲁泽 2019款 1.0T 双离合 Redline 320T 欢快版","雪佛兰 科鲁泽 2019款 1.0T 双离合 Redline 320T 欢快版","雪佛兰 科沃兹 2020款 1.0T 自动 325T 欣悦版","雪铁龙C3-XR 2018款 1.6L 自动 改款 时尚版","雪铁龙 C4L2015款 1.8L 手动 领先版","雪铁龙 C4L 2019款 1.2T 自动 230THP 舒适版","长安 CS75 2018款 1.5T 自动 两驱 280T 精智版 国V","众泰 大迈X5 2018款 1.5T 手动 智能互联版 尊享版","众泰 大迈X5 2018款 1.5T CVT 智能互联 尊贵版","大众 帕萨特 2019款 1.4T 双离合280TSI 商务版国VI","jeep 自由光 2019款 2.0L 自动 两驱典尚版 国V","别克 英朗 2019款 1.OT 双离合 15T 互联精英版 国VI","名爵 锐腾 2019款 2.0T 双离合 30T 两驱 尊享互联网氙灯版","标致 2008 2018款 1.6L 自动 潮流版","现代 ENCINO 昂希诺18款 1.6T 双离合致联版","起亚K5 2016款 2.0L 自动GLS","雪佛兰 科鲁泽 2019款 1.OT 双离合 Redline 320T 欢快版","日产 轩逸 2019款 1.6L CVT 经典 XE 舒适版","雪佛兰 科沃兹 2020款 1.OT 自动 325T 欣悦版","荣威RX3 2020款 1.6L CVT 4G互联超爽旗舰","荣威i5 2019款 1.5L CVT 4G互联领豪旗舰版","哈弗 H6 2019款 1.5T 自动 运动版 两驱精英型 国VI","福特 福克斯两厢 2018款 1.6L 双离合 两厢风尚版","起亚 奕跑 2019款 1.4L 自动 趣享版 国VI","名爵ZS 2019款 1.5L 手动 65寸巨幕天窗全球版 国VI","哈弗 M6 2019款 1.5T 双离合 精英型 国VI","起亚 福瑞迪 2019款 1.6L 自动 风尚版"],
	    seriesFilter: ["自由侠","自由光","奥迪Q2L","奥迪Q2L","宝马1系","宝马2系旅行车","北京BJ20","绅宝D70","绅宝D70","本田CR-V","缤智","凌派","思域","思域","雅阁","标致2008","昂科威","凯越","威朗","英朗","英朗","英朗","英朗","宝来","宝来","朗逸","朗逸","朗逸","迈腾","帕萨特","帕萨特","桑塔纳","速腾","速腾","风神AX5","景逸X5","景逸X5","卡罗拉","凯美瑞","雷凌","福克斯两厢","观致5","哈弗H6","哈弗H6","哈弗M6","汉腾X7","帝豪","博越","MEET 3","MEET 3","SEEK 5","猎豹CS9","逍遥","马自达3 昂克赛拉","马自达3 昂克赛拉","名爵ZS","名爵ZS","名爵GS","优6 SUV","瑞虎7i","福瑞迪","起亚K5","奕跑","蓝鸟","奇骏","逍客","轩逸","轩逸","荣威i5","荣威i5","荣威RX3","荣威RX5","荣威RX5","荣威RX5","荣威RX5","朗逸","明锐","速派","ENCINO","名图","现代ix25","创酷","科鲁泽","科鲁泽","科沃兹","雪铁龙C3-XR","雪铁龙C4L","雪铁龙C4L","长安CS75","大迈X5","大迈X5", "510"],
	    firmsFilter: ["广汽菲克Jeep","广汽菲克Jeep","一汽-大众奥迪","一汽-大众奥迪","华晨宝马","华晨宝马","北京越野","北京汽车","北京汽车","东风本田","广汽本田","广汽本田","东风本田","东风本田","广汽本田","东风标致","上汽通用别克","上汽通用别克","上汽通用别克","上汽通用别克","上汽通用别克","上汽通用别克","上汽通用别克","一汽-大众","一汽-大众","上汽大众","上汽大众","上汽大众","一汽-大众","上汽大众","上汽大众","上汽大众","一汽-大众","一汽-大众","东风风神","东风风行","东风风行","一汽丰田","广汽丰田","广汽丰田","长安福特","观致汽车","长城汽车（哈弗）","长城汽车（哈弗）","长城汽车（哈弗）","汉腾","吉利汽车","吉利汽车","君马汽车","君马汽车","君马汽车","猎豹汽车","陆风","长安马自达","长安马自达","上汽名爵","上汽名爵","上汽名爵","东风裕隆","奇瑞汽车","东风悦达起亚","东风悦达起亚","东风悦达起亚","东风日产","东风日产","东风日产","东风日产","东风日产","上汽荣威","上汽荣威","上汽荣威","上汽荣威","上汽荣威","上汽荣威","上汽荣威","上汽大众","上汽斯柯达","上汽斯柯达","上汽通用五菱(宝骏)","北京现代","北京现代","北京现代","上汽通用雪佛兰","上汽通用雪佛兰","上汽通用雪佛兰","上汽通用雪佛兰","东风雪铁龙","东风雪铁龙","东风雪铁龙","长安汽车","众泰汽车","众泰汽车"],
	    brandFilter: ["Jeep","Jeep","奥迪","奥迪","宝马","宝马","北京","北京汽车","北京汽车","本田","本田","本田","本田","本田","本田","标致","别克","别克","别克","别克","别克","别克","别克","大众","大众","大众","大众","大众","大众","大众","大众","大众","大众","大众","东风风神","东风风行","东风风行","丰田","丰田","丰田","福特","观致","哈弗","哈弗","哈弗","汉腾","吉利","吉利汽车","君马","君马","君马","猎豹","陆风","马自达","马自达","名爵","名爵","名爵","纳智捷","奇瑞","起亚","起亚","起亚","日产","日产","日产","日产","日产","荣威","荣威","荣威","荣威","荣威","荣威","荣威","上汽大众","斯柯达","斯柯达","宝骏","现代","现代","现代","雪佛兰","雪佛兰","雪佛兰","雪佛兰","雪铁龙","雪铁龙","雪铁龙","长安","众泰","众泰","上汽大众","广汽菲克JEEP","上汽通用别克","上汽名爵","东风标致","北京现代","东风悦达起亚","上汽通用雪佛兰","东风日产","上汽通用雪佛兰","上汽荣威","上汽荣威","长城汽车","福特","东风悦达起亚","上汽名爵","长城汽车","起亚"]
    };
  },
  methods: {
    onModelSelect(model) {
      console.log('真实页面获取的车型 ==>', model);
    },
  },
};
</script>

<style scoped>
.header {
  height: 60px;
  width: 100%;
  background-color: #66d5d3;
}
</style>
